Repository: Ivan-Tarasenko/Text-Fields
Catalog: Localization/*.lproj/Localizable.strings
Languages: es, ru, uk, zh_hk

# Text_Fields_All
source: Text Fields
es: Campos de texto
ru: Текстовые поля
uk: Текстові поля
zh_hk: 文本字段

# Text_Fields_NoDigit
source: Text Field without numbers
es: Campo de texto sin números
ru: Текстовое поле без цифр
uk: Текстове поле без цифр
zh_hk: 没有数字的文本字段

# Text_Fields_LimitChar
source: Restricted text field
es: Campo de texto restringido
ru: Ограниченное текстовое поле
uk: Обмежене текстове поле
zh_hk: 受限文本字段

# Text_Fields_OnlyChar
source: Text Tield for characters only
es: Campo de texto solo para caracteres
ru: Текстовое поле только для символов
uk: Текстове поле тільки для символів
zh_hk: 仅用于字符的文本字段

# Text_Fields_Link
source: Text Tield for the link
es: Campo de texto para el enlace
ru: Текстовое поле для ссылки
uk: Текстове поле для посилання
zh_hk: 链接的文本字段

# Text_Fields_Password
source: Password text field
es: Campo de texto de contraseña
ru: Текстовое поле пароля
uk: Текстове поле пароля
zh_hk: 密码文本字段

source: NO Digits field
es: Sin campo de dígitos
ru: БЕЗ цифр
uk: БЕЗ цифр
zh_hk: 無數字字段

source: Type here
es: Escriba aquí
ru: Пишите здесь
uk: Введіть тут
zh_hk: 在此處輸入

source: Input limit
es: Límite de entrada
ru: Предел ввода
uk: Обмеження введення
zh_hk: 輸入限制

source: Only characters
es: Solo personajes
ru: Только символы
uk: Лише символи
zh_hk: 只有字符

source: wwwww-ddddd
ru: ввввв-ддддд
uk: ввввв-ддддд

source: Link
es: Enlace
ru: Ссылка
uk: Посилання
zh_hk: 连结

source: www.example.com
es: www.example.es
ru: www.example.ru
uk: www.example.ua
zh_hk: www.example.cn

source: Validation rules
es: Reglas de validación
ru: Проверка пароля
uk: Правила перевірки пароля
zh_hk: 驗證規則

source: Password
es: Contraseña
ru: Пароль
uk: Пароль
zh_hk: 密碼

# Min_length_characters.
source: - Min length 8 characters.
es: - Longitud mínima 8 caracteres.
ru: - Мин 8 символов.
uk: - Мінімальна довжина 8 символів.
zh_hk: - 最小長度為 8 個字符。.

source: - Min 1 digit.
es: - Mínimo 1 dígito.
ru: - Мин 1 цыфра.
uk: - Мін. 1 цифра.
zh_hk: - 最少 1 位數字。.

source: - Min 1 lowercase.
es: - Min 1 minúscula.
ru: - Мин 1 строчный символ.
uk: - Мін. 1 нижній регістр.
zh_hk: - 最少 1 個小寫字母。.

source: - Min 1 capital required.
es: - Mínimo 1 capital requerido.
ru: - Мин 1 заглавный символ.
uk: - Мінімальний потрібен капітал.
zh_hk: - 最少需要 1 個資本。.

source: ✘ Special characters are not allowed
es: ✘ No se permiten caracteres especiales
ru: ✘ Cпецсимволы недопустимы
uk: ✘ Спеціальні символи не допускаються
zh_hk: ✘ 不允许使用特殊字符

source: ✘ Only English characters
es: ✘ Solo Caracteres en inglés
ru: ✘ Tолько английские символы
uk: ✘ Тільки англійські символи
zh_hk: ✘ 只有英文字符

# NoDigitstrInput
source: qwert123yu!@#
es: hola123!@#
uk: йцуке123нг!@#
zh_hk: 你好！123!@#

# NoDigitstrOut
source: qwertyu!@#
es: hola!@#
uk: йцукенг!@#
zh_hk: 你好！!@#

# limitStrInput
source: Checking limit character
es: Comprobación del carácter límite
uk: Перевірка граничного символу
zh_hk: 检查限制字符

# LinkString
source: There is a link here
es: Aquí hay un enlace
uk: Тут є посилання
zh_hk: 这里有一个链接

# Min_length_charactersTest
source: ✓ Min length 8 characters.
es: ✓ Longitud mínima 8 caracteres.
uk: ✓ Мінімальна довжина 8 символів.
zh_hk: ✓ 最小長度為 8 個字符。.

# Min_1_digitTest
source: ✓ Min 1 digit.
es: ✓ Mínimo 1 dígito.
uk: ✓ Мін. 1 цифра.
zh_hk: ✓ 最少 1 位數字。.

# Min_1_lowercaseTest
source: ✓ Min 1 lowercase.
es: ✓ Min 1 minúscula.
uk: ✓ Мін. 1 нижній регістр.
zh_hk: ✓ 最少 1 個小寫字母。.

# Min_1_capital_requiredTest
source: ✓ Min 1 capital required.
es: ✓ Mínimo 1 capital requerido.
uk: ✓ Мінімальний потрібен капітал.
zh_hk: ✓ 最少需要 1 個資本。.

source: Next keyboard
es: Teclado siguiente
uk: Наступна клавіатура
zh_hk: 下一個鍵盤
